<?php

namespace Database\Seeders;

use App\Models\Governorate;
use App\Models\Location;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class LocationSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $states = [
            "بغداد" => [ 'الكرخ', 'الرصافة', 'الفضل', 'الصدرية', 'باب الشيخ', 'العطيفية', 'الكاظمية', 'الاعظمية', 'الكريعات', 'الصليخ', 'حي القاهرة', 'حي المستنصرية', 'زيونة', 'راغبة خاتون', 'حي اليرموك', 'مدينة الصدر', 'الوزيرية', 'بغداد الجديدة', 'العبيدي', 'الرشاد', 'الكمالية', 'الاورفلي', 'البلديات', 'البياع', 'السيدية', 'حي الخضراء', 'الراشدية', 'حي الزهور', 'الحسينية', 'حي الاستقلال', 'الكرادة', 'العامرية', 'الفحامة', 'حي الشعب', 'حي اور', 'حي المنصور', 'حي القادسية', 'حي المامون', 'الدورة', 'الغزالية', 'الجادرية', 'الزعفرانية', 'المدائن', 'ابو غريب', 'الشعلة', 'الحرية', 'شارع فلسطين', 'التاجي', 'الطارمية', 'جسر ديالى', 'حي العامل', 'حي الجهاد', 'حي الفرات', 'المحمودية', 'اليوسفية', 'الرشيد'],
            "الانبار" => ['الرمادي', 'الفلوجة', 'القائم', 'هيت', 'حديثة', 'الحبانية', 'الخالدية', 'الوليد', 'الساجرية', 'الرطبة', 'عكاشات', 'البغدادي', 'الكرابلة', 'كبيسة', 'النخيب', 'النعيمية', 'السجر', 'الرحالية', 'الصقرة', 'الجبه', 'الحميرية', 'الاوسط', 'الرمانة', 'الهبارية', 'الكسرة', 'الصقلاوية', 'العبيدي', 'عانة', 'راوة', 'العامرية', 'بروانة', 'الكرمة', 'الحقلانية', 'سعدة', 'الزاوية', 'الريحانة', 'الفرات', 'المحمدي', 'حصيبة الشرقية'],
            "نينوى" => ['الموصل', 'حمام العليل', 'القيارة', 'الشورة', 'بعشيقة', 'المحلبية', 'حميدات', 'تلعفر', 'العياضية', 'ربيعة', 'زمار', 'سنجار', 'الشمال او سنوني', 'البعاج', 'القيروان', 'القحطانية', 'الحضر', 'تل عبطة', 'الحمدانية', 'برطلة', 'تلكيف', 'وانة', 'القوش', 'فايدة', 'الشيخان', 'مخمور', 'الكوير', 'قراج'],
            "اربيل" => ['اربيل', 'ناحية كسنزان', 'ناحية الكلك', 'شقلاوة', 'منتجع صلاح الدين|صلاح الدين', 'كوي سنجق', 'رواندوز', 'عينكاوة', 'سوران', 'ميركسور', 'جومان', 'خبات', 'بنصلاوة'],
            "كركوك" => ['كركوك', 'تازة خورماتو', 'تازة', 'الملتقى', 'شوان', 'التون كوبري', 'دبس', 'داقوق', 'ليلان', 'الحويجة', 'الزاب', 'الرياض', 'العباسي', 'الرشاد'],
            "دهوك" => ['دهوك', 'زاخو', 'دركار', 'عقرة', 'زاويته', 'سرسنك', 'العمادية', 'شرانش', 'سميل', 'كاني ماسي', 'سولاف', 'باطوفا', 'فايدة', 'باتيل', 'بامرني', 'جامانكي', 'مانكيشك', 'هيزاوا'],
            "السليمانية" => ['السليمانية', 'رانية', 'قلعة دزة', 'حلبجة', 'دوكان', 'قضاء بنجوين', 'جمجمال', 'خرمال', 'دربندخان', 'ميدان سراي', 'باوة نور',],
            "ديالى" => ['بعقوبة', 'خانقين', 'جلولاء', 'بلدروز', 'كفري', 'قرة بولاق', 'قرة تبة', 'العظيم', 'المنصورية', 'بهرز', 'خان بني سعد', 'الخالص', 'مندلي', 'ترساق', 'نفط خانة', 'المقدادية'],
            "صلاح الدين" => ['تكريت', 'العوجة', 'ناحية العلم', 'الدور', 'سامراء', 'مكيشيفة', 'المعتصم', 'بيجي', 'الصينية', 'الشرقاط', 'بلد', 'الضلوعية', 'يثرب', 'عزيز بلد', 'الاسحاقي', 'الدجيل', 'طوز خورماتو', 'سليمان بيك', 'آمرلي', 'ينكجة'],

            "البصرة" => ['البصرة', 'ام قصر', 'الفاو', 'صفوان', 'الزبير', 'ابو الخصيب', 'القرنة', 'المدينة', 'الهوير', 'الهارثة', 'التنومة', 'الشعيبة', 'الرميلة'],
            "ذي قار" => ['الناصرية', 'الشطرة', 'البطحاء', 'سوق الشيوخ', 'قلعة سكر', 'الرفاعي', 'الغراف', 'الحمٌار', 'الجبايش'],
            "المثنى" => ['السماوة', 'الرميثة', 'الخضر', 'الدراجي', 'السلمان', 'بصية',],
            "ميسان" => ['العمارة', 'علي الغربي', 'الميمونة', 'المجر', 'قلعة صالح', 'الكحلاء', 'علي الشرقي', 'كميت', 'المشرح', 'السلام', 'الخير', 'العدل', 'بني هاشم', 'العزير', 'احمد الرفاعي'],

            "القادسية" => ['الديوانية', 'الشامية', 'عفك', 'الحمزة', 'الدغارة', 'الشنافية', 'الصلاحية',],
            "واسط" => ['الكوت', 'الصويرة', 'العزيزية', 'الزبيدية', 'النعمانية', 'شيخ سعد', 'الحي', 'بدرة', 'جصان',],
            "النجف" => ['النجف', 'الكوفة', 'المناذرة', 'الحيرة', 'العباسية', 'المشخاب', 'ناحية القادسية', 'الحرية', 'الحيدرية', 'شبكة'],
            "بابل" => ['الحلة',
                'المحمودية',
                'سلمان باك',
                'الحمزة الغربي',
                'الاسكندرية',
                'المسيب',
                'المحاويل',
                'الهاشمية',
                'المشروع',
                'اللطيفية',
                'الحصوة',
                'القاسم',
                'الامام',
                'المدحتية',
                'الكفل',
                'الشوملي'],

            "كربلاء" => [
                'كربلاء',
                'عين تمر',
                'شثاثة',
                'الهندية',
                'طويريج'],
        ];

        foreach ($states as $province => $locations) {
            $governorate = Governorate::create(['name' => $province]);

            $locations = collect($locations)->map(function ($name) {
                return Location::firstOrCreate(['name' => $name, 'trusted' => true])->id;
            });

            $governorate->locations()->attach($locations);

        }
    }
}
